Revit 2027 API
ParameterTypeId.StairstypeMaximumRiserHeight Property
 "Max. Riser Height": Maximum Riser Height
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeMaximumRiserHeight { get; }
Public Shared ReadOnly Property StairstypeMaximumRiserHeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeMaximumRiserHeight {
	ForgeTypeId^ get ();
}
static member StairstypeMaximumRiserHeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace